Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2A.xml
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="1.3.0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x400A1000"/>
            <parameters>
              <param name="MASTER_NUM" value="6"/>
              <param name="MASTER_CPU_IDCODE" value="0"/>
              <param name="MASTER_CPU_SYS" value="1"/>
              <param name="MASTER_SMAP" value="2"/>
              <param name="MASTER_PDCA" value="3"/>
              <param name="MASTER_USBC" value="4"/>
              <param name="MASTER_CRCCU" value="5"/>
              <param name="SLAVE_NUM" value="8"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_HTOP0" value="1"/>
              <param name="SLAVE_HTOP1" value="2"/>
              <param name="SLAVE_HTOP2" value="3"/>
              <param name="SLAVE_HTOP3" value="4"/>
              <param name="SLAVE_HRAMC0" value="5"/>
              <param name="SLAVE_HRAMC1" value="6"/>
              <param name="SLAVE_AESA" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="IISC" id="I7560" version="1.0.0">
          <instance name="IISC">
            <register-group name="IISC" name-in-module="IISC" address-space="base" offset="0x40004000"/>
            <signals>
              <signal group="IMCK" function="D" pad="PB05"/>
              <signal group="IMCK" function="D" pad="PC14"/>
              <signal group="IMCK" function="B" pad="PA31"/>
              <signal group="ISCK" function="D" pad="PB02"/>
              <signal group="ISCK" function="D" pad="PC09"/>
              <signal group="ISCK" function="B" pad="PA27"/>
              <signal group="ISDI" function="D" pad="PB03"/>
              <signal group="ISDI" function="D" pad="PC10"/>
              <signal group="ISDI" function="B" pad="PA28"/>
              <signal group="ISDO" function="D" pad="PB04"/>
              <signal group="ISDO" function="D" pad="PC13"/>
              <signal group="ISDO" function="B" pad="PA30"/>
              <signal group="IWS" function="D" pad="PB06"/>
              <signal group="IWS" function="D" pad="PC12"/>
              <signal group="IWS" function="B" pad="PA29"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="LCDCA" id="I7572" version="1.0.0">
          <instance name="LCDCA">
            <register-group name="LCDCA" name-in-module="LCDCA" address-space="base" offset="0x40080000"/>
            <signals>
              <signal group="BIAS1" function="default" pad="BIAS1"/>
              <signal group="BIAS2" function="default" pad="BIAS2"/>
              <signal group="CAPH" function="default" pad="CAPH"/>
              <signal group="CAPL" function="default" pad="CAPL"/>
              <signal group="COM" index="0" function="F" pad="PA12"/>
              <signal group="COM" index="1" function="F" pad="PA11"/>
              <signal group="COM" index="2" function="F" pad="PA10"/>
              <signal group="COM" index="3" function="F" pad="PA09"/>
              <signal group="SEG" index="0" function="F" pad="PC15"/>
              <signal group="SEG" index="1" function="F" pad="PC16"/>
              <signal group="SEG" index="2" function="F" pad="PC17"/>
              <signal group="SEG" index="3" function="F" pad="PC18"/>
              <signal group="SEG" index="4" function="F" pad="PC19"/>
              <signal group="SEG" index="5" function="F" pad="PA13"/>
              <signal group="SEG" index="6" function="F" pad="PA14"/>
              <signal group="SEG" index="7" function="F" pad="PA15"/>
              <signal group="SEG" index="8" function="F" pad="PA16"/>
              <signal group="SEG" index="9" function="F" pad="PA17"/>
              <signal group="SEG" index="10" function="F" pad="PC20"/>
              <signal group="SEG" index="11" function="F" pad="PC21"/>
              <signal group="SEG" index="12" function="F" pad="PC22"/>
              <signal group="SEG" index="13" function="F" pad="PC23"/>
              <signal group="SEG" index="14" function="F" pad="PB08"/>
              <signal group="SEG" index="15" function="F" pad="PB09"/>
              <signal group="SEG" index="16" function="F" pad="PB10"/>
              <signal group="SEG" index="17" function="F" pad="PB11"/>
              <signal group="SEG" index="18" function="F" pad="PA18"/>
              <signal group="SEG" index="19" function="F" pad="PA19"/>
              <signal group="SEG" index="20" function="F" pad="PA20"/>
              <signal group="SEG" index="21" function="F" pad="PB07"/>
              <signal group="SEG" index="22" function="F" pad="PB06"/>
              <signal group="SEG" index="23" function="F" pad="PA08"/>
              <signal group="SEG" index="24" function="F" pad="PC24"/>
              <signal group="SEG" index="25" function="F" pad="PC25"/>
              <signal group="SEG" index="26" function="F" pad="PC26"/>
              <signal group="SEG" index="27" function="F" pad="PC27"/>
              <signal group="SEG" index="28" function="F" pad="PC28"/>
              <signal group="SEG" index="29" function="F" pad="PC29"/>
              <signal group="SEG" index="30" function="F" pad="PC30"/>
              <signal group="SEG" index="31" function="F" pad="PC31"/>
              <signal group="SEG" index="32" function="F" pad="PB12"/>
              <signal group="SEG" index="33" function="F" pad="PB13"/>
              <signal group="SEG" index="34" function="F" pad="PA21"/>
              <signal group="SEG" index="35" function="F" pad="PA22"/>
              <signal group="SEG" index="36" function="F" pad="PB14"/>
              <signal group="SEG" index="37" function="F" pad="PB15"/>
              <signal group="SEG" index="38" function="F" pad="PA23"/>
              <signal group="SEG" index="39" function="F" pad="PA24"/>
              <signal group="VLCD" function="default" pad="VLCD"/>
            </signals>
          </instance>
        </module>
        <module name="PARC" id="I7570" version="1.0.0">
          <instance name="PARC">
            <register-group name="PARC" name-in-module="PARC" address-space="base" offset="0x4006C000"/>
            <signals>
              <signal group="PCCK" function="D" pad="PA17"/>
              <signal group="PCCK" function="D" pad="PC21"/>
              <signal group="PCDATA" index="0" function="D" pad="PA09"/>
              <signal group="PCDATA" index="0" function="D" pad="PC24"/>
              <signal group="PCDATA" index="1" function="D" pad="PA10"/>
              <signal group="PCDATA" index="1" function="D" pad="PC25"/>
              <signal group="PCDATA" index="2" function="D" pad="PA11"/>
              <signal group="PCDATA" index="2" function="D" pad="PC26"/>
              <signal group="PCDATA" index="3" function="D" pad="PA12"/>
              <signal group="PCDATA" index="3" function="D" pad="PC27"/>
              <signal group="PCDATA" index="4" function="D" pad="PA13"/>
              <signal group="PCDATA" index="4" function="D" pad="PC28"/>
              <signal group="PCDATA" index="5" function="D" pad="PA14"/>
              <signal group="PCDATA" index="5" function="D" pad="PC29"/>
              <signal group="PCDATA" index="6" function="D" pad="PA15"/>
              <signal group="PCDATA" index="6" function="D" pad="PC30"/>
              <signal group="PCDATA" index="7" function="D" pad="PA16"/>
              <signal group="PCDATA" index="7" function="D" pad="PC31"/>
              <signal group="PCEN1" function="D" pad="PA18"/>
              <signal group="PCEN1" function="D" pad="PC22"/>
              <signal group="PCEN2" function="D" pad="PA19"/>
              <signal group="PCEN2" function="D" pad="PC23"/>
            </signals>
          </instance>
        </module>
        <module name="PDCA" id="I7514" version="1.2.4">
          <instance name="PDCA">
            <register-group name="PDCA" name-in-module="PDCA" address-space="base" offset="0x400A2000"/>
            <parameters>
              <param name="CHANNEL_LENGTH" value="16"/>
              <param name="MON_CH0_IMPL" value="0"/>
              <param name="MON_CH1_IMPL" value="0"/>
            </parameters>
          </instance>
        </module>
