Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2A.xml
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000102" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="AST" id="I7532" version="3.1.1" caption="Asynchronous Timer">
      <register-group name="AST" caption="Asynchronous Timer">
        <register name="CR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1" values="AST_CR__EN"/>
          <bitfield name="PCLR" caption="Prescaler Clear" mask="0x2"/>
          <bitfield name="CAL" caption="Calendar mode" mask="0x4"/>
          <bitfield name="CA0" caption="Clear on Alarm 0" mask="0x100"/>
          <bitfield name="CA1" caption="Clear on Alarm 1" mask="0x200"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0x1F0000"/>
        </register>
        <register name="CV" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Counter Value">
          <bitfield name="VALUE" caption="AST Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
          <bitfield name="BUSY" caption="AST Busy" mask="0x1000000" values="AST_SR__BUSY"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000"/>
          <bitfield name="CLKBUSY" caption="Clock Busy" mask="0x10000000" values="AST_SR__CLKBUSY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000"/>
        </register>
        <register name="SCR" offset="0xc" rw="W" size="4" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_IER__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_IER__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_IER__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_IER__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_IER__PER1"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000" values="AST_IER__READY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000" values="AST_IER__CLKRDY"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_IDR__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_IDR__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_IDR__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_IDR__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_IDR__PER1"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000" values="AST_IDR__READY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000" values="AST_IDR__CLKRDY"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_IMR__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_IMR__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_IMR__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_IMR__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_IMR__PER1"/>
          <bitfield name="READY" caption="AST Ready" mask="0x2000000" values="AST_IMR__READY"/>
          <bitfield name="CLKRDY" caption="Clock Ready" mask="0x20000000" values="AST_IMR__CLKRDY"/>
        </register>
        <register name="WER" offset="0x1c" rw="RW" size="4" initval="0x00000000" caption="Wake Enable Register">
          <bitfield name="OVF" caption="Overflow" mask="0x1" values="AST_WER__OVF"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100" values="AST_WER__ALARM0"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200" values="AST_WER__ALARM1"/>
          <bitfield name="PER0" caption="Periodic 0" mask="0x10000" values="AST_WER__PER0"/>
          <bitfield name="PER1" caption="Periodic 1" mask="0x20000" values="AST_WER__PER1"/>
        </register>
        <register name="AR0" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Alarm Register 0">
          <bitfield name="VALUE" caption="Alarm Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="AR1" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Alarm Register 1">
          <bitfield name="VALUE" caption="Alarm Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="PIR0" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Periodic Interval Register 0">
          <bitfield name="INSEL" caption="Interval Select" mask="0x1F"/>
        </register>
