Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2A.xml
      <value-group name="BSCIF_BGCTRL__ADCISEL">
        <value name="DIS" value="0"/>
        <value name="VTEMP" value="1"/>
        <value name="VREF" value="2"/>
      </value-group>
      <value-group name="BSCIF_BGSR__BGBUFRDY">
        <value name="FLASH" value="1"/>
        <value name="PLL" value="2"/>
        <value name="VREG" value="4"/>
        <value name="BUFRR" value="8"/>
        <value name="ADC" value="16"/>
        <value name="LCD" value="32"/>
      </value-group>
    </module>
    <module name="CATB" id="I7567" version="1.0.0" caption="Capacitive Touch Module B">
      <register-group name="CATB" caption="Capacitive Touch Module B">
        <register name="CR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Module Enable" mask="0x1"/>
          <bitfield name="RUN" caption="Start Operation" mask="0x2"/>
          <bitfield name="IIDLE" caption="Initialize Idle Value" mask="0x4"/>
          <bitfield name="ETRIG" caption="Event Triggered Operation" mask="0x8"/>
          <bitfield name="INTRES" caption="Internal Resistors" mask="0x10"/>
          <bitfield name="CKSEL" caption="Clock Select" mask="0x20"/>
          <bitfield name="DIFF" caption="Differential Mode" mask="0x40"/>
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x80"/>
          <bitfield name="ESAMPLES" caption="Number of Event Samples" mask="0x7F00"/>
          <bitfield name="CHARGET" caption="Charge Time" mask="0xF0000"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x80000000"/>
        </register>
        <register name="CNTCR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Counter Control Register">
          <bitfield name="TOP" caption="Counter Top Value" mask="0xFFFFFF"/>
          <bitfield name="SPREAD" caption="Spread Spectrum" mask="0xF000000"/>
          <bitfield name="REPEAT" caption="Repeat Measurements" mask="0x70000000"/>
        </register>
        <register name="IDLE" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Sensor Idle Level">
          <bitfield name="FIDLE" caption="Fractional Sensor Idle" mask="0xFFF"/>
          <bitfield name="RIDLE" caption="Integer Sensor Idle" mask="0xFFFF000"/>
        </register>
        <register name="LEVEL" offset="0xc" rw="R" size="4" initval="0x00000000" caption="Sensor Relative Level">
          <bitfield name="FLEVEL" caption="Fractional Sensor Level" mask="0xFFF"/>
          <bitfield name="RLEVEL" caption="Integer Sensor Level" mask="0xFF000"/>
        </register>
        <register name="RAW" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Sensor Raw Value">
          <bitfield name="RAWA" caption="Current Sensor Raw Value" mask="0xFF0000"/>
          <bitfield name="RAWB" caption="Last Sensor Raw Value" mask="0xFF000000"/>
        </register>
        <register name="TIMING" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Filter Timing Register">
          <bitfield name="TLEVEL" caption="Relative Level Smoothing" mask="0xFFF"/>
          <bitfield name="TIDLE" caption="Idle Smoothening" mask="0xFFF0000"/>
        </register>
        <register name="THRESH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Threshold Register">
          <bitfield name="FTHRESH" caption="Fractional part of Threshold Value" mask="0xFFF"/>
          <bitfield name="RTHRESH" caption="Rational part of Threshold Value" mask="0xFF000"/>
          <bitfield name="DIR" caption="Threshold Direction" mask="0x800000"/>
          <bitfield name="LENGTH" caption="Threshold Length" mask="0x1F000000"/>
        </register>
        <register name="PINSEL" offset="0x1c" rw="RW" size="4" initval="0x00000000" caption="Pin Selection Register">
          <bitfield name="PINSEL" caption="Pin Select" mask="0xFF"/>
        </register>
        <register name="DMA" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Direct Memory Access Register">
          <bitfield name="DMA" caption="Direct Memory Access" mask="0xFFFFFFFF"/>
        </register>
        <register name="ISR" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Status" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Status" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Status" mask="0x4"/>
        </register>
        <register name="IER" offset="0x28" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Enable" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Enable" mask="0x4"/>
        </register>
        <register name="IDR" offset="0x2c" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Disable" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Disable" mask="0x4"/>
        </register>
        <register name="IMR" offset="0x30" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Mask" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Mask" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Mask" mask="0x4"/>
        </register>
        <register name="SCR" offset="0x34" rw="W" size="4" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="SAMPLE" caption="Sample Ready" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch" mask="0x4"/>
        </register>
