Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2A.xml
        <register name="IADR" offset="0x34" rw="W" size="4" initval="0x00000000" caption="Indirect Access Data Register">
          <bitfield name="DATA" caption="Segments Value" mask="0xFF"/>
          <bitfield name="DMASK" caption="Data Mask" mask="0xFF00"/>
          <bitfield name="OFF" caption="Byte Offset" mask="0x1F0000"/>
        </register>
        <register name="BCFG" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Blink Configuration Register">
          <bitfield name="MODE" caption="Blinking Mode" mask="0x1"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x6"/>
          <bitfield name="BSS0" caption="Blink Segment Selection 0" mask="0xF00"/>
          <bitfield name="BSS1" caption="Blink Segment Selection 1" mask="0xF000"/>
        </register>
        <register name="CSRCFG" offset="0x3c" rw="RW" size="4" initval="0x00000000" caption="Circular Shift Register Configuration">
          <bitfield name="DIR" caption="Direction" mask="0x1"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x6"/>
          <bitfield name="SIZE" caption="Size" mask="0x38"/>
          <bitfield name="DATA" caption="Circular Shift Register Value" mask="0xFF00"/>
        </register>
        <register name="CMCFG" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Character Mapping Configuration Register">
          <bitfield name="DREV" caption="Digit Reverse Mode" mask="0x1"/>
          <bitfield name="TDG" caption="Type of Digit" mask="0x6"/>
          <bitfield name="STSEG" caption="Start Segment" mask="0x3F00"/>
        </register>
        <register name="CMDR" offset="0x44" rw="W" size="4" initval="0x00000000" caption="Character Mapping Data Register">
          <bitfield name="ASCII" caption="ASCII Code" mask="0x7F"/>
        </register>
        <register name="ACMCFG" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="Automated Character Mapping Configuration Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x6"/>
          <bitfield name="MODE" caption="Mode (sequential or scrolling)" mask="0x8"/>
          <bitfield name="DREV" caption="Digit Reverse" mask="0x10"/>
          <bitfield name="TDG" caption="Type of Digit" mask="0x60"/>
          <bitfield name="STSEG" caption="Start Segment" mask="0x3F00"/>
          <bitfield name="STEPS" caption="Scrolling Steps" mask="0xFF0000"/>
          <bitfield name="DIGN" caption="Digit Number" mask="0xF000000"/>
        </register>
        <register name="ACMDR" offset="0x4c" rw="W" size="4" initval="0x00000000" caption="Automated Character Mapping Data Register">
          <bitfield name="ASCII" caption="ASCII Code" mask="0x7F"/>
        </register>
        <register name="ABMCFG" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="Automated Bit Mapping Configuration Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="FCS" caption="Frame Counter Selection" mask="0x6"/>
          <bitfield name="SIZE" caption="Size" mask="0x1F00"/>
        </register>
        <register name="ABMDR" offset="0x54" rw="W" size="4" initval="0x00000000" caption="Automated Bit Mapping Data Register">
          <bitfield name="DATA" caption="Segments Value" mask="0xFF"/>
          <bitfield name="DMASK" caption="Data Mask" mask="0xFF00"/>
          <bitfield name="OFF" caption="Byte Offset" mask="0x1F0000"/>
        </register>
        <register name="IER" offset="0x58" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="FC0R" caption="Frame Counter 0 Rollover" mask="0x1"/>
        </register>
        <register name="IDR" offset="0x5c" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="FC0R" caption="Frame Counter 0 Rollover" mask="0x1"/>
        </register>
        <register name="IMR" offset="0x60" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="FC0R" caption="Frame Counter 0 Rollover" mask="0x1"/>
        </register>
        <register name="VERSION" offset="0x64" rw="R" size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PARC" id="I7570" version="1.0.0" caption="Parallel Capture">
      <register-group name="PARC" caption="Parallel Capture">
        <register name="CFG" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="DSIZE" caption="Data Size" mask="0x3"/>
          <bitfield name="SMODE" caption="Sampling Mode" mask="0xC"/>
          <bitfield name="EMODE" caption="Events Mode" mask="0x10"/>
          <bitfield name="EDGE" caption="Sampling Edge Select" mask="0x20"/>
          <bitfield name="HALF" caption="Half Capture" mask="0x40"/>
          <bitfield name="ODD" caption="Odd Capture" mask="0x80"/>
        </register>
        <register name="CR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
          <bitfield name="START" caption="Start Capture" mask="0x4"/>
          <bitfield name="STOP" caption="Stop Capture" mask="0x8"/>
        </register>
        <register name="IER" offset="0x8" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Enable" mask="0x8"/>
        </register>
        <register name="IDR" offset="0xc" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Disable" mask="0x8"/>
        </register>
        <register name="IMR" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Mask" mask="0x8"/>
        </register>
        <register name="SR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="EN" caption="Enable Status" mask="0x1"/>
          <bitfield name="CS" caption="Capture Status" mask="0x2"/>
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status" mask="0x8"/>
        </register>
        <register name="ICR" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Interrupt Status Clear Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Status Clear" mask="0x4"/>
          <bitfield name="OVR" caption="Overrun Interrupt Status Clear" mask="0x8"/>
        </register>
