Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC2A.xml
        <register name="EXID" offset="0xf4" rw="R" size="4" caption="Chip ID Extension Register">
          <bitfield name="EXID" caption="Chip ID Extension" mask="0xFFFFFFFF"/>
        </register>
        <register name="IDR" offset="0xfc" rw="R" size="4" initval="0x003E0000" caption="AP Identification register">
          <bitfield name="APIDV" caption="AP Identification Variant" mask="0xF"/>
          <bitfield name="APID" caption="AP Identification" mask="0xF0"/>
          <bitfield name="CLSS" caption="Class" mask="0x10000"/>
          <bitfield name="IC" caption="JEP-106 Identity Code" mask="0xFE0000"/>
          <bitfield name="CC" caption="JEP-106 Continuation Code" mask="0xF000000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000000"/>
        </register>
      </register-group>
    </module>
    <module name="SPI" id="I7602" version="2.1.1" caption="Serial Peripheral Interface">
      <register-group name="SPI" caption="Serial Peripheral Interface">
        <register name="CR" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="SPIEN" caption="SPI Enable" mask="0x1" values="SPI_CR__SPIEN"/>
          <bitfield name="SPIDIS" caption="SPI Disable" mask="0x2" values="SPI_CR__SPIDIS"/>
          <bitfield name="SWRST" caption="SPI Software Reset" mask="0x80" values="SPI_CR__SWRST"/>
          <bitfield name="FLUSHFIFO" caption="Flush FIFO command" mask="0x100"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000" values="SPI_CR__LASTXFER"/>
        </register>
        <register name="MR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="MSTR" caption="Master/Slave Mode" mask="0x1" values="SPI_MR__MSTR"/>
          <bitfield name="PS" caption="Peripheral Select" mask="0x2" values="SPI_MR__PS"/>
          <bitfield name="PCSDEC" caption="Chip Select Decode" mask="0x4" values="SPI_MR__PCSDEC"/>
          <bitfield name="MODFDIS" caption="Mode Fault Detection" mask="0x10" values="SPI_MR__MODFDIS"/>
          <bitfield name="WDRBT" caption="wait data read before transfer" mask="0x20"/>
          <bitfield name="RXFIFOEN" caption="FIFO in Reception Enable" mask="0x40"/>
          <bitfield name="LLB" caption="Local Loopback Enable" mask="0x80" values="SPI_MR__LLB"/>
          <bitfield name="PCS" caption="Peripheral Chip Select" mask="0xF0000"/>
          <bitfield name="DLYBCS" caption="Delay Between Chip Selects" mask="0xFF000000"/>
        </register>
        <register name="RDR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Receive Data Register">
          <bitfield name="RD" caption="Receive Data" mask="0xFFFF"/>
          <bitfield name="PCS" caption="Peripheral Chip Select" mask="0xF0000"/>
        </register>
        <register name="TDR" offset="0xc" rw="W" size="4" initval="0x00000000" caption="Transmit Data Register">
          <bitfield name="TD" caption="Transmit Data" mask="0xFFFF"/>
          <bitfield name="PCS" caption="Peripheral Chip Select" mask="0xF0000"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000" values="SPI_TDR__LASTXFER"/>
        </register>
        <register name="SR" offset="0x10" rw="R" size="4" initval="0x000000F0" caption="Status Register">
          <bitfield name="RDRF" caption="Receive Data Register Full" mask="0x1" values="SPI_SR__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty" mask="0x2" values="SPI_SR__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error" mask="0x4" values="SPI_SR__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Status" mask="0x8" values="SPI_SR__OVRES"/>
          <bitfield name="ENDRX" caption="End of RX buffer" mask="0x10" values="SPI_SR__ENDRX"/>
          <bitfield name="ENDTX" caption="End of TX buffer" mask="0x20" values="SPI_SR__ENDTX"/>
          <bitfield name="RXBUFF" caption="RX Buffer Full" mask="0x40" values="SPI_SR__RXBUFF"/>
          <bitfield name="TXBUFE" caption="TX Buffer Empty" mask="0x80" values="SPI_SR__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising" mask="0x100" values="SPI_SR__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty" mask="0x200" values="SPI_SR__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Status (Slave Mode Only)" mask="0x400"/>
          <bitfield name="SPIENS" caption="SPI Enable Status" mask="0x10000" values="SPI_SR__SPIENS"/>
        </register>
        <register name="IER" offset="0x14" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RDRF" caption="Receive Data Register Full Interrupt Enable" mask="0x1" values="SPI_IER__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty Interrupt Enable" mask="0x2" values="SPI_IER__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error Interrupt Enable" mask="0x4" values="SPI_IER__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Interrupt Enable" mask="0x8" values="SPI_IER__OVRES"/>
          <bitfield name="ENDRX" caption="End of Receive Buffer Interrupt Enable" mask="0x10" values="SPI_IER__ENDRX"/>
          <bitfield name="ENDTX" caption="End of Transmit Buffer Interrupt Enable" mask="0x20" values="SPI_IER__ENDTX"/>
          <bitfield name="RXBUFF" caption="Receive Buffer Full Interrupt Enable" mask="0x40" values="SPI_IER__RXBUFF"/>
          <bitfield name="TXBUFE" caption="Transmit Buffer Empty Interrupt Enable" mask="0x80" values="SPI_IER__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising Interrupt Enable" mask="0x100" values="SPI_IER__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty Enable" mask="0x200" values="SPI_IER__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Interrupt Enable" mask="0x400"/>
        </register>
        <register name="IDR" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RDRF" caption="Receive Data Register Full Interrupt Disable" mask="0x1" values="SPI_IDR__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty Interrupt Disable" mask="0x2" values="SPI_IDR__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error Interrupt Disable" mask="0x4" values="SPI_IDR__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Interrupt Disable" mask="0x8" values="SPI_IDR__OVRES"/>
          <bitfield name="ENDRX" caption="End of Receive Buffer Interrupt Disable" mask="0x10" values="SPI_IDR__ENDRX"/>
          <bitfield name="ENDTX" caption="End of Transmit Buffer Interrupt Disable" mask="0x20" values="SPI_IDR__ENDTX"/>
          <bitfield name="RXBUFF" caption="Receive Buffer Full Interrupt Disable" mask="0x40" values="SPI_IDR__RXBUFF"/>
          <bitfield name="TXBUFE" caption="Transmit Buffer Empty Interrupt Disable" mask="0x80" values="SPI_IDR__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising Interrupt Disable" mask="0x100" values="SPI_IDR__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty Disable" mask="0x200" values="SPI_IDR__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Interrupt Disable" mask="0x400"/>
        </register>
        <register name="IMR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RDRF" caption="Receive Data Register Full Interrupt Mask" mask="0x1" values="SPI_IMR__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty Interrupt Mask" mask="0x2" values="SPI_IMR__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error Interrupt Mask" mask="0x4" values="SPI_IMR__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Interrupt Mask" mask="0x8" values="SPI_IMR__OVRES"/>
          <bitfield name="ENDRX" caption="End of Receive Buffer Interrupt Mask" mask="0x10" values="SPI_IMR__ENDRX"/>
          <bitfield name="ENDTX" caption="End of Transmit Buffer Interrupt Mask" mask="0x20" values="SPI_IMR__ENDTX"/>
          <bitfield name="RXBUFF" caption="Receive Buffer Full Interrupt Mask" mask="0x40" values="SPI_IMR__RXBUFF"/>
          <bitfield name="TXBUFE" caption="Transmit Buffer Empty Interrupt Mask" mask="0x80" values="SPI_IMR__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising Interrupt Mask" mask="0x100" values="SPI_IMR__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty Mask" mask="0x200" values="SPI_IMR__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Interrupt Mask" mask="0x400"/>
        </register>
        <register name="CSR" offset="0x30" rw="RW" size="4" count="4" initval="0x00000000" caption="Chip Select Register">
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x1" values="SPI_CSR__CPOL"/>
          <bitfield name="NCPHA" caption="Clock Phase" mask="0x2" values="SPI_CSR__NCPHA"/>
          <bitfield name="CSNAAT" caption="Chip Select Not Active After Transfer" mask="0x4"/>
          <bitfield name="CSAAT" caption="Chip Select Active After Transfer" mask="0x8" values="SPI_CSR__CSAAT"/>
          <bitfield name="BITS" caption="Bits Per Transfer" mask="0xF0" values="SPI_CSR__BITS"/>
          <bitfield name="SCBR" caption="Serial Clock Baud Rate" mask="0xFF00"/>
          <bitfield name="DLYBS" caption="Delay Before SPCK" mask="0xFF0000"/>
          <bitfield name="DLYBCT" caption="Delay Between Consecutive Transfers" mask="0xFF000000"/>
        </register>
        <register name="WPCR" offset="0xe4" rw="RW" size="4" initval="0x00000000" caption="Write Protection control Register">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protection Key Password" mask="0xFFFFFF00" values="SPI_WPCR__WPKEY"/>
        </register>
        <register name="WPSR" offset="0xe8" rw="R" size="4" initval="0x00000000" caption="Write Protection status Register">
          <bitfield name="WPVS" caption="Write Protection Violation Status" mask="0x7" values="SPI_WPSR__WPVS"/>
          <bitfield name="WPVSRC" caption="Write Protection Violation Source" mask="0xFF00"/>
        </register>
        <register name="FEATURES" offset="0xf8" rw="R" size="4" caption="Features Register">
          <bitfield name="NCS" caption="Number of Chip Selects" mask="0xF"/>
          <bitfield name="PCONF" caption="Polarity is Configurable" mask="0x10"/>
          <bitfield name="PPNCONF" caption="Polarity is Positive if Polarity is not Configurable" mask="0x20"/>
          <bitfield name="PHCONF" caption="Phase is Configurable" mask="0x40"/>
          <bitfield name="PHZNCONF" caption="Phase is Zero if Phase is not Configurable" mask="0x80"/>
          <bitfield name="LENCONF" caption="Character Length is Configurable" mask="0x100"/>
          <bitfield name="LENNCONF" caption="Character Length if not Configurable" mask="0xFE00"/>
          <bitfield name="EXTDEC" caption="External Decoder is True" mask="0x10000"/>
          <bitfield name="CSNAATIMPL" caption="CSNAAT Features are Implemented" mask="0x20000"/>
          <bitfield name="BRPBHSB" caption="Bridge Type is PB to HSB" mask="0x40000"/>
          <bitfield name="FIFORIMPL" caption="FIFO in Reception is Implemented" mask="0x80000"/>
          <bitfield name="SWPIMPL" caption="Spurious Write Protection is Implemented" mask="0x100000"/>
        </register>
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000211" caption="Version Register">
          <bitfield name="VERSION" caption="Version" mask="0xFFF"/>
          <bitfield name="MFN" caption="mfn" mask="0x70000"/>
        </register>
      </register-group>
